AllrunFlexiblePrep
#!/bin/sh
cd "${0%/*}" || exit 1

echo "Running fluid baseline in fluidCase/"
(cd fluidCase && ./Allrun) || exit 1

echo
echo "Running solid baseline in solidCase/"
(cd solidCase && ./Allrun) || exit 1

echo
echo "Completed fluid and solid baseline runs."
echo "Note: this is not two-way FSI coupling yet."
